{
    "name": "Jack Welch",
    "desc": "Executive Chairman, The Jack Welch Management Institute",
    "address": "New York, New York, United States",
    "followers": "7M followers",
    "connection": "500+ connections",
    "about": "Jack Welch is one of the world's most respected and celebrated CEOs, known for his unmatched track record of success, enormous love of people, fierce passion for winning, and unbridled desire to change the world for the better using his unique management practices, which are collectively called The Welch Way.In his 21 years as CEO, Jack transformed GE into the world's most admired and successful company with his innovative management techniques. Revenues grew five-fold from $25 billion to $130 billion, income grew ten-fold, from $1.5 billion to $15 billion, and the company's market capitalization had a 30-fold increase of more than $400 billion. His achievements are considered epic, and as a result, thousands of companies around the world have adopted the Welch Way.After retiring from GE in 2001, Jack Welch has only become more active in business. He has written three best-selling business books, Jack: Straight from the Gut, Winning, and The Real Life MBA. He actively participates in managing numerous companies as part of a private equity group, and for four years wrote an immensely popular weekly column for BusinessWeek magazine. He is a fixture on TV as a popular business commentator.Jack has always been defined by his zealous love of teaching and commitment to building leaders. At GE, he created the world's best corporate training center and regularly taught there himself. More recently, he taught a popular course as a visiting professor at MIT's Sloan School of Management.In 2010, Jack founded the Jack Welch Management Institute, a business school that offers executive education and management training. Jack is intimately involved in every aspect of the Institute. As Executive Chairman, he hosts video conferences with students, appears in exclusive videos about current business events and is deeply engaged in the development of the program's curriculum.",
    "articles": [
        {
            "title": "No More Eyerolls Please, Thank You Very Much",
            "date": "Oct 15, 2018",
            "link": "https://www.linkedin.com/pulse/more-eyerolls-please-thank-you-very-much-jack-welch?trk=public_profile_article_view <view-source:https://www.linkedin.com/pulse/more-eyerolls-please-thank-you-very-much-jack-welch?trk=public_profile_article_view>"
        },
        {
            "title": "So Many Leaders Get This Wrong",
            "date": "Jun 28, 2018",
            "link": "https://www.linkedin.com/pulse/so-many-leaders-get-wrong-jack-welch?trk=public_profile_article_view <view-source:https://www.linkedin.com/pulse/so-many-leaders-get-wrong-jack-welch?trk=public_profile_article_view>"
        },
        {
            "title": "'Rank-and-Yank'? That's Not How It's Done",
            "date": "Apr 12, 2018",
            "link": "https://www.linkedin.com/pulse/rank-and-yank-thats-how-its-done-jack-welch?trk=public_profile_article_view <view-source:https://www.linkedin.com/pulse/rank-and-yank-thats-how-its-done-jack-welch?trk=public_profile_article_view>"
        }
    ],
    "activities": [
        {
            "title": "After three years of studying at JWMI, I received my Master’s degree in the mail today. This journey is one of the greatest educational experiences I…",
            "link": "https://www.linkedin.com/posts/wcollado_after-three-years-of-studying-at-jwmi-i-activity-6634642983184592896-evta?trk=public_profile_like_view <view-source:https://www.linkedin.com/posts/wcollado_after-three-years-of-studying-at-jwmi-i-activity-6634642983184592896-evta?trk=public_profile_like_view>"
        },
        {
            "title": "Are you working for the right person? Ask yourself one question- is your career a big deal to them? If not, move on quickly. \n\n#career…",
            "link": "https://www.linkedin.com/posts/johnfwelch_jack-welch-what-makes-a-great-boss-generosity-activity-6635916205561573376-XT3q?trk=public_profile_share_view <view-source:https://www.linkedin.com/posts/johnfwelch_jack-welch-what-makes-a-great-boss-generosity-activity-6635916205561573376-XT3q?trk=public_profile_share_view>"
        },
        {
            "title": "No one should have a job that doesn't get them jazzed to get up in the morning. As a leader... what do you do to make work…",
            "link": "https://www.linkedin.com/posts/johnfwelch_jack-welch-work-is-fun-activity-6633727526340481024-KBzY?trk=public_profile_share_view <view-source:https://www.linkedin.com/posts/johnfwelch_jack-welch-work-is-fun-activity-6633727526340481024-KBzY?trk=public_profile_share_view>"
        }
    ]
}